In [8]:
import pandas as pd
df = pd.read_csv('csv/decessi_tot.csv')

In [9]:
df.head()

         Data  Totale
0  2015-01-01    2632
1  2015-01-02    2182
2  2015-01-03    2215
3  2015-01-04    2264
4  2015-01-05    2301

In [10]:
df['Data'] = pd.to_datetime(df['Data'])

In [11]:
df.index=df['Data']
df.head()

                 Data  Totale
Data
2015-01-01 2015-01-01    2632
2015-01-02 2015-01-02    2182
2015-01-03 2015-01-03    2215
2015-01-04 2015-01-04    2264
2015-01-05 2015-01-05    2301

In [12]:
#raggruppo e sommo i decessi in base al mese
df = df.groupby(pd.Grouper(freq='M')).sum()

In [13]:
df.head()

            Totale
Data
2015-01-31   68514
2015-02-28   61031
2015-03-31   60418
2015-04-30   53591
2015-05-31   50678

In [14]:
df.to_csv('csv/decessi_mensili.csv')